Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: وما هذه الحياة الدنيا إلا لهو ولعب وإن الدار الآخرة لهي الحيوان لو كانوا يعلمون
en: And this life of the world is only an amusement and a play! Verily, the home of the Hereafter - that is the life indeed (i.e. the eternal life that will never end), if they but knew .

source: فإذا ركبوا في الفلك دعوا الله مخلصين له الدين فلما نجاهم إلى البر إذا هم يشركون
en: And when they embark on a ship, they invoke Allah, making their Faith pure for Him only: but when He brings them safely to land, behold, they give a share of their worship to others .

source: ليكفروا بما آتيناهم وليتمتعوا فسوف يعلمون
en: So that they become ingrate for that which We have given them, and that they take their enjoyment (as a warning and a threat), but they will come to know.

source: أولم يروا أنا جعلنا حرما آمنا ويتخطف الناس من حولهم أفبالباطل يؤمنون وبنعمة الله يكفرون
en: Have they not seen that We have made (Makkah) a secure sanctuary, while men are being snatched away from all around them? Then do they believe in Batil (falsehood - polytheism, idols and all deities other than Allah), and deny (become ingrate for) the Graces of Allah?

source: ومن أظلم ممن افترى على الله كذبا أو كذب بالحق لما جاءه أليس في جهنم مثوى للكافرين
en: And who does more wrong than he who invents a lie against Allah or denies the truth (Muhammad صلى الله عليه وسلم and his doctrine of Islamic Monotheism and this Qur'an), when it comes to him? Is there not a dwelling in Hell for disbelievers (in the Oneness of Allah and in His Messenger Muhammad صلى الله عليه وسلم)?

source: والذين جاهدوا فينا لنهدينهم سبلنا وإن الله لمع المحسنين
en: As for those who strive hard in Us (Our Cause), We will surely guide them to Our Paths (i.e. Allah's religion - Islamic Monotheism). And verily, Allah is with the Muhsinun (good doers)."

source: غلبت الروم
en: The Romans have been defeated.

source: في أدنى الأرض وهم من بعد غلبهم سيغلبون
en: In the nearest land (Syria, Iraq, Jordan, and Palestine), and they, after their defeat, will be victorious.

source: في بضع سنين لله الأمر من قبل ومن بعد ويومئذ يفرح المؤمنون
en: Within three to nine years. The decision of the matter, before and after (these events) is only with Allah, (before the defeat of the Romans by the Persians, and after the defeat of the Persians by the Romans). And on that Day, the believers (i.e. Muslims) will rejoice (at the victory given by Allah to the Romans against the Persians) -

source: بنصر الله ينصر من يشاء وهو العزيز الرحيم
en: With the help of Allah. He helps whom He wills, and He is the All-Mighty, the Most Merciful.

source: وعد الله لا يخلف الله وعده ولكن أكثر الناس لا يعلمون
en: (It is) a Promise of Allah (i.e. Allah will give victory to the Romans against the Persians), and Allah fails not in His Promise, but most of men know not.

source: يعلمون ظاهرا من الحياة الدنيا وهم عن الآخرة هم غافلون
en: They know only the outside appearance of the life of the world (i.e. the matters of their livelihood, like irrigating or sowing or reaping, etc.), and they are heedless of the Hereafter.

source: أولم يتفكروا في أنفسهم ما خلق الله السماوات والأرض وما بينهما إلا بالحق وأجل مسمى وإن كثيرا من الناس بلقاء ربهم لكافرون
en: Do they not think deeply (in their ownselves) about themselves (how Allah created them from nothing, and similarly He will resurrect them)? Allah has created not the heavens and the earth, and all that is between them, except with truth and for an appointed term. And indeed many of mankind deny the Meeting with their Lord. [Tafsir At-Tabari].

source: أولم يسيروا في الأرض فينظروا كيف كان عاقبة الذين من قبلهم كانوا أشد منهم قوة وأثاروا الأرض وعمروها أكثر مما عمروها وجاءتهم رسلهم بالبينات فما كان الله ليظلمهم ولكن كانوا أنفسهم يظلمون
en: Do they not travel in the land, and see what was the end of those before them? They were superior to them in strength, and they tilled the earth and populated it in greater numbers than these (pagans) have done: and there came to them their Messengers with clear proofs. Surely, Allah wronged them not, but they used to wrong themselves.

source: ثم كان عاقبة الذين أساءوا السوأى أن كذبوا بآيات الله وكانوا بها يستهزئون
en: Then evil was the end of those who did evil, because they belied the Ayat (proofs, evidence, verses, lessons, signs, revelations, Messengers, etc.) of Allah and made a mockery of them.

source: الله يبدأ الخلق ثم يعيده ثم إليه ترجعون
en: Allah (Alone) originates the creation, then He will repeat it, then to Him you will be returned.

source: ويوم تقوم الساعة يبلس المجرمون
en: And on the Day when the Hour will be established, the Mujrimun (disbelievers, sinners, criminals, polytheists) will be plunged into destruction with (deep regrets, sorrows, and) despair.

source: ولم يكن لهم من شركائهم شفعاء وكانوا بشركائهم كافرين
en: No intercessors will they have from those whom they made equal with Allah (partners i.e. their so-called associate gods), and they will (themselves) reject and deny their partners.

source: ويوم تقوم الساعة يومئذ يتفرقون
en: And on the Day when the Hour will be established - that Day shall (all men) be separated (i.e. the believers will be separated from the disbelievers).

source: فأما الذين آمنوا وعملوا الصالحات فهم في روضة يحبرون
en: Then as for those who believed (in the Oneness of Allah - Islamic Monotheism) and did righteous good deeds, such shall be honoured and made to enjoy luxurious life (forever) in a Garden of Delight (Paradise).

source: وأما الذين كفروا وكذبوا بآياتنا ولقاء الآخرة فأولئك في العذاب محضرون
en: And as for those who disbelieved and belied Our Ayat (proofs, evidence, verses, lessons, signs, revelations, Allah's Messengers, Resurrection, etc.), and the Meeting of the Hereafter, such shall be brought forth to the torment (in the Hell-fire).

source: فسبحان الله حين تمسون وحين تصبحون
en: So glorify Allah [above all that (evil) they associate with Him (O believers)] when you come up to the evening [i.e. offer the (Maghrib ) sunset and ('Isha') night prayers], and when you enter the morning [i.e. offer the (Fajr) morning prayer].

source: وله الحمد في السماوات والأرض وعشيا وحين تظهرون
en: And His are all the praises and thanks in the heavens and the earth; and (glorify Him) in the afternoon (i.e. offer 'Asr prayer) and when you come up to the time, when the day begins to decline (i.e. offer Zuhr prayer). (Ibn 'Abbas said: "These are the five compulsory congregational prayers mentioned in the Qur'an)." [Tafsir At-Tabari]

source: يخرج الحي من الميت ويخرج الميت من الحي ويحيي الأرض بعد موتها وكذلك تخرجون
en: He brings out the living from the dead, and brings out the dead from the living. And He revives the earth after its death. And thus shall you be brought out (resurrected).

source: ومن آياته أن خلقكم من تراب ثم إذا أنتم بشر تنتشرون
en: And among His Signs is this, that He created you (Adam) from dust, and then [Hawwa' (Eve) from Adam's rib, and then his offspring from the semen, and], - behold you are human beings scattered!

source: ومن آياته أن خلق لكم من أنفسكم أزواجا لتسكنوا إليها وجعل بينكم مودة ورحمة إن في ذلك لآيات لقوم يتفكرون
en: And among His Signs is this, that He created for you wives from among yourselves, that you may find repose in them, and He has put between you affection and mercy. Verily, in that are indeed signs for a people who reflect.

source: ومن آياته خلق السماوات والأرض واختلاف ألسنتكم وألوانكم إن في ذلك لآيات للعالمين
en: And among His Signs is the creation of the heavens and the earth, and the difference of your languages and colours. Verily, in that are indeed signs for men of sound knowledge.

source: ومن آياته منامكم بالليل والنهار وابتغاؤكم من فضله إن في ذلك لآيات لقوم يسمعون
en: And among His Signs is your sleep by night and by day, and your seeking of His Bounty. Verily, in that are indeed signs for a people who listen.

source: ومن آياته يريكم البرق خوفا وطمعا وينزل من السماء ماء فيحيي به الأرض بعد موتها إن في ذلك لآيات لقوم يعقلون
en: And among His Signs is that He shows you the lightning, for fear and for hope, and He sends down water (rain) from the sky, and therewith revives the earth after its death. Verily, in that are indeed signs for a people who understand.

source: ومن آياته أن تقوم السماء والأرض بأمره ثم إذا دعاكم دعوة من الأرض إذا أنتم تخرجون
en: And among His Signs is that the heaven and the earth stand by His Command. Then afterwards when He will call you by a single call, behold, you will come out from the earth (i.e. from your graves for reckoning and recompense).

source: وله من في السماوات والأرض كل له قانتون
en: To Him belongs whatever is in the heavens and the earth. All are obedient to Him.

source: وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه وله المثل الأعلى في السماوات والأرض وهو العزيز الحكيم
en: And He it is Who originates the creation, then He will repeat it (after it has been perished); and this is easier for Him. His is the highest description (i.e. none has the right to be worshipped but He, and there is nothing comparable unto Him) in the heavens and in the earth. And He is the All-Mighty, the All-Wise.

source: ضرب لكم مثلا من أنفسكم هل لكم من ما ملكت أيمانكم من شركاء في ما رزقناكم فأنتم فيه سواء تخافونهم كخيفتكم أنفسكم كذلك نفصل الآيات لقوم يعقلون
en: He sets forth for you a parable from your ownselves: Do you have partners among those whom your right hands possess (i.e. your slaves) to share as equals in the wealth We have bestowed on you whom you fear as you fear each other? Thus do We explain the signs in detail to a people who have sense.

source: بل اتبع الذين ظلموا أهواءهم بغير علم فمن يهدي من أضل الله وما لهم من ناصرين
en: Nay, but those who do wrong follow their own lusts without knowledge. Then who will guide him whom Allah has sent astray? And for such there will be no helpers.

source: فأقم وجهك للدين حنيفا فطرت الله التي فطر الناس عليها لا تبديل لخلق الله ذلك الدين القيم ولكن أكثر الناس لا يعلمون
en: So set you (O Muhammad صلى الله عليه وسلم) your face towards the religion (of pure Islamic Monotheism) Hanif (worship none but Allah Alone). Allah's Fitrah (i.e. Allah's Islamic Monotheism) with which He has created mankind. No change let there be in Khalq-illah (i.e. the religion of Allah - Islamic Monotheism): that is the straight religion, but most of men know not. [Tafsir At-Tabari]

source: منيبين إليه واتقوه وأقيموا الصلاة ولا تكونوا من المشركين
en: (And remain always) turning in repentance to Him (only), and be afraid and dutiful to Him; and perform As-Salat (Iqamat-as-Salat) and be not of Al-Mushrikun (the polytheists, idolaters, disbelievers in the Oneness of Allah).

source: من الذين فرقوا دينهم وكانوا شيعا كل حزب بما لديهم فرحون
en: Of those who split up their religion (i.e. who left the true Islamic Monotheism), and became sects, [i.e. they invented new things in the religion (Bid'ah ), and followed their vain desires], each sect rejoicing in that which is with it.

source: وإذا مس الناس ضر دعوا ربهم منيبين إليه ثم إذا أذاقهم منه رحمة إذا فريق منهم بربهم يشركون
en: And when harm touches men, they cry sincerely only to their Lord (Allah), turning to Him in repentance; but when He gives them a taste of His Mercy, behold, a party of them associates partners in worship with their Lord.

source: أم أنزلنا عليهم سلطانا فهو يتكلم بما كانوا به يشركون
en: Or have We revealed to them an authority (a Scripture), which speaks of that which they have been associating with Him?

source: وإذا أذقنا الناس رحمة فرحوا بها وإن تصبهم سيئة بما قدمت أيديهم إذا هم يقنطون
en: And when We cause mankind to taste of mercy, they rejoice therein; but when some evil afflicts them because of (evil deeds and sins) that their (own) hands have sent forth, behold, they are in despair!

source: أولم يروا أن الله يبسط الرزق لمن يشاء ويقدر إن في ذلك لآيات لقوم يؤمنون
en: Do they not see that Allah enlarges the provision for whom He wills and straitens (it for whom He wills). Verily, in that are indeed signs for a people who believe.

source: فآت ذا القربى حقه والمسكين وابن السبيل ذلك خير للذين يريدون وجه الله وأولئك هم المفلحون
en: So give to the kindred his due, and to Al-Miskin (the poor) and to the wayfarer. That is best for those who seek Allah's Countenance; and it is they who will be successful.

source: وما آتيتم من ربا ليربو في أموال الناس فلا يربو عند الله وما آتيتم من زكاة تريدون وجه الله فأولئك هم المضعفون
en: And that which you give in gift (to others), in order that it may increase (your wealth by expecting to get a better one in return) from other people's property, has no increase with Allah; but that which you give in Zakat (sadaqa - charity etc.) seeking Allah's Countenance, then those, they shall have manifold increase.

source: الله الذي خلقكم ثم رزقكم ثم يميتكم ثم يحييكم هل من شركائكم من يفعل من ذلكم من شيء سبحانه وتعالى عما يشركون
en: Allah is He Who created you, then provided food for you, then will cause you to die, then (again) He will give you life (on the Day of Resurrection). Is there any of your (so-called) partners (of Allah) that do anything of that? Glory be to Him! And Exalted be He above all that (evil) they associate (with Him).

source: ظهر الفساد في البر والبحر بما كسبت أيدي الناس ليذيقهم بعض الذي عملوا لعلهم يرجعون
en: Evil (sins and disobedience to Allah) has appeared on land and sea because of what the hands of men have earned (by oppression and evil deeds), that He (Allah) may make them taste a part of that which they have done, in order that they may return (by repenting to Allah, and begging His Pardon).

source: قل سيروا في الأرض فانظروا كيف كان عاقبة الذين من قبل كان أكثرهم مشركين
en: Say (O Muhammad صلى الله عليه وسلم): "Travel in the land and see what was the end of those before (you)! Most of them were Mushrikun (polytheists, idolaters, disbelievers in the Oneness of Allah)."

source: فأقم وجهك للدين القيم من قبل أن يأتي يوم لا مرد له من الله يومئذ يصدعون
en: So set you (O Muhammad صلى الله عليه وسلم) your face (in obedience to Allah, your Lord) to the straight and right religion (Islamic Monotheism), before there comes from Allah a Day which none can avert. On that Day men shall be divided [(in two groups), a group in Paradise and a group in Hell].

source: من كفر فعليه كفره ومن عمل صالحا فلأنفسهم يمهدون
en: Whosoever disbelieves will suffer from his disbelief, and whosoever does righteous good deeds (by practising Islamic Monotheism), then such will prepare a good place (in Paradise) for themselves (and will be saved by Allah from His Torment).

source: ليجزي الذين آمنوا وعملوا الصالحات من فضله إنه لا يحب الكافرين
en: That He may reward those who believe (in the Oneness of Allah - Islamic Monotheism), and do righteous good deeds, out of His Bounty. Verily, He likes not the disbelievers.

source: ومن آياته أن يرسل الرياح مبشرات وليذيقكم من رحمته ولتجري الفلك بأمره ولتبتغوا من فضله ولعلكم تشكرون
en: And among His Signs is this, that He sends the winds as glad tidings, giving you a taste of His Mercy (i.e. rain), and that the ships may sail at His Command, and that you may seek of His Bounty, in order that you may be thankful.

source: ولقد أرسلنا من قبلك رسلا إلى قومهم فجاءوهم بالبينات فانتقمنا من الذين أجرموا وكان حقا علينا نصر المؤمنين
en: And indeed We did send Messengers before you (O Muhammad صلى الله عليه وسلم) to their own peoples. They came to them with clear proofs, then, We took vengeance on those who committed crimes (disbelief, setting partners in worship with Allah, sins); and (as for) the believers, it was incumbent upon Us to help (them).

source: الله الذي يرسل الرياح فتثير سحابا فيبسطه في السماء كيف يشاء ويجعله كسفا فترى الودق يخرج من خلاله فإذا أصاب به من يشاء من عباده إذا هم يستبشرون
en: Allah is He Who sends the winds, so that they raise clouds, and spread them along the sky as He wills, and then break them into fragments, until you see rain drops come forth from their midst! Then when He has made them fall on whom of His slaves as He wills, lo, they rejoice!

source: وإن كانوا من قبل أن ينزل عليهم من قبله لمبلسين
en: And verily before that (rain) - just before it was sent down upon them - they were in despair!

source: فانظر إلى آثار رحمت الله كيف يحيي الأرض بعد موتها إن ذلك لمحيي الموتى وهو على كل شيء قدير
en: Look then at the effects (results) of Allah's Mercy: how He revives the earth after its death. Verily, that (Allah) (Who revived the earth after its death) shall indeed raise the dead (on the Day of Resurrection), and He is Able to do all things.

source: ولئن أرسلنا ريحا فرأوه مصفرا لظلوا من بعده يكفرون
en: And if We send a wind [which would spoil the green growth (tilth) brought up by the previous rain], and they see (their tilth) turn yellow - behold, they then (after their being glad,) would become unthankful (to their Lord Allah as) disbelievers. [Tafsir At-Tabari]

source: فإنك لا تسمع الموتى ولا تسمع الصم الدعاء إذا ولوا مدبرين
en: So verily, you (O Muhammad صلى الله عليه وسلم) cannot make the dead to hear (i.e. the disbelievers), nor can you make the deaf to hear the call, when they show their backs and turn away.

source: وما أنت بهاد العمي عن ضلالتهم إن تسمع إلا من يؤمن بآياتنا فهم مسلمون
en: And you (O Muhammad صلى الله عليه وسلم) cannot guide the blind from their straying; you can make to hear only those who believe in Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.), and have submitted to Allah in Islam (as Muslims).

source: الله الذي خلقكم من ضعف ثم جعل من بعد ضعف قوة ثم جعل من بعد قوة ضعفا وشيبة يخلق ما يشاء وهو العليم القدير
en: Allah is He Who created you in (a state of) weakness, then gave you strength after weakness, then after strength gave (you) weakness and grey hair. He creates what He wills. And it is He Who is the All-Knowing, the All-Powerful (i.e. Able to do all things).

source: ويوم تقوم الساعة يقسم المجرمون ما لبثوا غير ساعة كذلك كانوا يؤفكون
en: And on the Day that the Hour will be established, the Mujrimun (criminals, disbelievers, polytheists, sinners) will swear that they stayed not but an hour - thus were they ever deluded [away from the truth (i.e. they used to tell lies and take false oaths, and turn away from the truth) in this life of the world)]

source: وقال الذين أوتوا العلم والإيمان لقد لبثتم في كتاب الله إلى يوم البعث فهذا يوم البعث ولكنكم كنتم لا تعلمون
en: And those who have been bestowed with knowledge and faith will say: "Indeed you have stayed according to the Decree of Allah, until the Day of Resurrection: so this is the Day of Resurrection, but you knew not."

source: فيومئذ لا ينفع الذين ظلموا معذرتهم ولا هم يستعتبون
en: So on that Day no excuse of theirs will avail those who did wrong (by associating partners in worship with Allah, and by denying the Day of Resurrection), nor will they be allowed (then) to return to seek Allah's Pleasure (by having Islamic Faith with righteous deeds and by giving up polytheism, sins and crimes with repentance).

source: ولقد ضربنا للناس في هذا القرآن من كل مثل ولئن جئتهم بآية ليقولن الذين كفروا إن أنتم إلا مبطلون
en: And indeed We have set forth for mankind, in this Qur'an every kind of parable. But if you (O Muhammad صلى الله عليه وسلم) bring to them any sign or proof (as an evidence for the truth of your Prophethood), the disbelievers are sure to say (to the believers): "You follow nothing but falsehood, and magic."

source: كذلك يطبع الله على قلوب الذين لا يعلمون
en: Thus does Allah seal up the hearts of those who know not [the proofs and evidence of the Oneness of Allah i.e. those who try not to understand true facts that which you (Muhammad صلى الله عليه وسلم) have brought to them].

source: فاصبر إن وعد الله حق ولا يستخفنك الذين لا يوقنون
en: So be patient (O Muhammad صلى الله عليه وسلم). Verily, the Promise of Allah is true; and let not those who have no certainty of faith, discourage you from conveying Allah's Message (which you are obliged to convey).

source: تلك آيات الكتاب الحكيم
en: These are Verses of the Wise Book (the Qur'an).

source: هدى ورحمة للمحسنين
en: A guide and a mercy for the Muhsinun (good-doers).

source: ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله بغير علم ويتخذها هزوا أولئك لهم عذاب مهين
en: And of mankind is he who purchases idle talks (i.e. music, singing, etc.) to mislead (men) from the Path of Allah without knowledge, and takes it (the Path of Allah, or the Verses of the Qur'an) by way of mockery. For such there will be a humiliating torment (in the Hell-fire).

source: وإذا تتلى عليه آياتنا ولى مستكبرا كأن لم يسمعها كأن في أذنيه وقرا فبشره بعذاب أليم
en: And when Our Verses (of the Qur'an) are recited to such a one, he turns away in pride, as if he heard them not - as if there were deafness in his ear. So announce to him a painful torment.

source: إن الذين آمنوا وعملوا الصالحات لهم جنات النعيم
en: Verily, those who believe (in Islamic Monotheism) and do righteous good deeds, for them are Gardens of Delight (Paradise).

source: خالدين فيها وعد الله حقا وهو العزيز الحكيم
en: To abide therein. It is a Promise of Allah in truth. And He is the All-Mighty, the All-Wise.

source: خلق السماوات بغير عمد ترونها وألقى في الأرض رواسي أن تميد بكم وبث فيها من كل دابة وأنزلنا من السماء ماء فأنبتنا فيها من كل زوج كريم
en: He has created the heavens without any pillars that you see, and has set on the earth firm mountains lest it should shake with you. And He has scattered therein moving (living) creatures of all kinds. And We send down water (rain) from the sky, and We cause (plants) of every goodly kind to grow therein.

source: هذا خلق الله فأروني ماذا خلق الذين من دونه بل الظالمون في ضلال مبين
en: This is the creation of Allah. So show Me that which those (whom you worship) besides Him have created. Nay, the Zalimun (polytheists, wrongdoers and those who do not believe in the Oneness of Allah) are in plain error.

source: ولقد آتينا لقمان الحكمة أن اشكر لله ومن يشكر فإنما يشكر لنفسه ومن كفر فإن الله غني حميد
en: And indeed We bestowed upon Luqman Al-Hikmah (wisdom and religious understanding) saying: "Give thanks to Allah." And whoever gives thanks, he gives thanks for (the good of) his ownself. And whoever is unthankful, then verily, Allah is All-Rich (Free of all needs), Worthy of all praise.

source: وإذ قال لقمان لابنه وهو يعظه يا بني لا تشرك بالله إن الشرك لظلم عظيم
en: And (remember) when Luqman said to his son when he was advising him: "O my son! Join not in worship others with Allah. Verily joining others in worship with Allah is a great Zulm (wrong) indeed.

source: ووصينا الإنسان بوالديه حملته أمه وهنا على وهن وفصاله في عامين أن اشكر لي ولوالديك إلي المصير
en: And We have enjoined on man (to be dutiful and good) to his parents. His mother bore him in weakness and hardship upon weakness and hardship, and his weaning is in two years - give thanks to Me and to your parents. Unto Me is the final destination.

source: وإن جاهداك على أن تشرك بي ما ليس لك به علم فلا تطعهما وصاحبهما في الدنيا معروفا واتبع سبيل من أناب إلي ثم إلي مرجعكم فأنبئكم بما كنتم تعملون
en: But if they (both) strive with you to make you join in worship with Me others that of which you have no knowledge, then obey them not; but behave with them in the world kindly, and follow the path of him who turns to Me in repentance and in obedience. Then to Me will be your return, and I shall tell you what you used to do.

source: يا بني إنها إن تك مثقال حبة من خردل فتكن في صخرة أو في السماوات أو في الأرض يأت بها الله إن الله لطيف خبير
en: "O my son! If it be (anything) equal to the weight of a grain of mustard seed, and though it be in a rock, or in the heavens or in the earth, Allah will bring it forth. Verily, Allah is Subtle (in bringing out that grain), Well-Aware (of its place).
